Repository: universalcore/unicore-cms-connectsmart
Catalog: unicorecmsgem/locale/ben_BD/LC_MESSAGES/unicorecmsgem.po
Languages: ben_bd

source: What Is The Girl Effect
ben_bd: মেয়ে প্রভাব (Girl Effect) কী?

source: Learn more about The Girl Effect
ben_bd: মেয়ে প্রভাব (The Girl Effect) সম্পর্কে আরও জানুন

source: And spread the word
ben_bd: এবং তথ্য ছড়িয়ে

source: Latest
ben_bd: সাম্প্রতিকতম

source: More
ben_bd: আরও

source: The Girl Declaration
ben_bd: মেয়েদের ঘোষণা

source: Read It Now.
ben_bd: এটি এখনই পড়

source: And share it with other girls
ben_bd: এবং অন্যান্য মেয়ের সাথে এটি শেয়ার কর

source: Contact
ben_bd: যোগাযোগ

source: Terms &amp; Conditions
ben_bd: শর্তাবলী

source: Tips on Use
ben_bd: ব্যবহার উপায়

source: Home
ben_bd: হোমপেজে
