Repository: universalcore/unicore-cms-connectsmart
Catalog: unicorecmsgem/locale/mal_*/LC_MESSAGES/unicorecmsgem.po
Languages: in

source: What Is The Girl Effect
in: എന്താണ്‌ ഗേള്‍ ഇഫക്‌ട്‌

source: Learn more about The Girl Effect
in: ഗേള്‍ ഇഫക്‌ടിനെ കുറിച്ച്‌ കൂടുതല്‍ പഠിക്കുക

source: And spread the word
in: പദം പ്രചരിപ്പിക്കുക

source: Latest
in: ഏറ്റവും പുതിയത്‌

source: More
in: കൂടുതല്‍

source: The Girl Declaration
in: പെണ്കു്ട്ടി പ്രഖ്യാപനം

source: Read It Now.
in: അത്‌ ഇപ്പോള്‍ വായിക്കുക

source: And share it with other girls
in: മറ്റ്‌ പെണ്കു്ട്ടികളുമായി അത്‌ പങ്ക്‌

source: Contact
in: ബന്ധപ്പെടുക

source: Terms &amp; Conditions
in: വ്യവസ്ഥകളും നിബന്ധനകളും

source: Tips on Use
in: ഉപയോഗത്തെ സംബന്ധിച്ച നിര്ദേനശങ്ങള്‍

source: Home
in: ഹോം
