Repository: universalcore/unicore-cms-connectsmart
Catalog: unicorecmsgem/locale/por_*/LC_MESSAGES/unicorecmsgem.po
Languages: pt

source: What Is The Girl Effect
pt: O que é o Girl Effect?

source: Learn more about The Girl Effect
pt: Saiba mais sobre o Girl Effect

source: And spread the word
pt: E espalhar a palavra

source: Latest
pt: Mais Recentes

source: More
pt: Mais

source: The Girl Declaration
pt: O depoimento da garota

source: Read It Now.
pt: Leia agora

source: And share it with other girls
pt: E compartilhe com outras meninas

source: Contact
pt: Contato

source: Terms &amp; Conditions
pt: Termos de Uso

source: Tips on Use
pt: Dicas de uso

source: Home
pt: Começo
