Repository: universalcore/unicore-cms-connectsmart
Catalog: unicorecmsgem/locale/spa_MX/LC_MESSAGES/unicorecmsgem.po
Languages: spa_es

source: Home
spa_es: Inicio

source: What Is The Girl Effect
spa_es: ¿Qué es Girl Effect?

source: Learn more about The Girl Effect
spa_es: Conoce más sobre The Girl Effect

source: And spread the word
spa_es: Y difundir la palabra

source: Latest
spa_es: Novedades

source: More
spa_es: Más

source: The Girl Declaration
spa_es: La Declaración de las niñas

source: Read It Now.
spa_es: Léelo ahora

source: And share it with other girls
spa_es: y compártelo con otras chicas

source: Contact
spa_es: Contacto

source: Terms &amp; Conditions
spa_es: TÉRMINOS DE USO

source: Tips on Use
spa_es: Consejos de Uso
