Repository: universalcore/unicore-cms-connectsmart
Catalog: unicorecmsgem/locale/mar_*/LC_MESSAGES/unicorecmsgem.po
Languages: in

source: What Is The Girl Effect
in: गर्ल इफेक्ट म्हणजे काय

source: Learn more about The Girl Effect
in: गर्ल इफेक्टबद्दल अधिक जाणून घ्या

source: And spread the word
in: ही माहिती इतरांना द्या

source: Latest
in: अद्ययावत

source: More
in: अधिक

source: The Girl Declaration
in: मुलींचे घोषणापत्र

source: Read It Now.
in: हे आता वाचा

source: And share it with other girls
in: आणि इतर मुलींसोबत शेअर करा

source: Contact
in: संपर्क

source: Terms &amp; Conditions
in: अटी आणि शर्ती

source: Tips on Use
in: वापरासाठी सूचना

source: Home
in: होम
