Repository: universalcore/unicore-cms-connectsmart
Catalog: unicorecmsgem/locale/urd_*/LC_MESSAGES/unicorecmsgem.po
Languages: in

source: What Is The Girl Effect
in: Girl Effect کیا ہے ؟

source: Learn more about The Girl Effect
in: Girl Effect کے بارے میں مزید جانیں

source: And spread the word
in: اور اس معلومات کا اشتراک

source: Latest
in: تازہ ترین

source: More
in: مزید

source: The Girl Declaration
in: لڑکیوں کا اعلامیہ

source: Read It Now.
in: اسے ابھی پڑھیں

source: And share it with other girls
in: اور دوسری لڑکیوں کے ساتھ شریک کریں

source: Contact
in: رابطہ

source: Terms &amp; Conditions
in: شرائط برائے استعمال

source: Tips on Use
in: استعمال کے طریقے:

source: Home
in: سر ورق
